results/rest/stage-10000/payload-small/1000VUs/repeat-1/1000vus-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./src/rest/restTest.js
        output: json (./results/rest/stage-10000/payload-small/1000VUs/repeat-1/1000vus.json)

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 1000 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.9s), 1000/1000 VUs, 294 complete and 0 interrupted iterations
default   [   2% ] 1000 VUs  0m00.9s/1m0s

running (0m01.3s), 1000/1000 VUs, 980 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  0m01.9s/1m0s

running (0m02.3s), 1000/1000 VUs, 1811 complete and 0 interrupted iterations
default   [   5% ] 1000 VUs  0m02.9s/1m0s

running (0m03.3s), 1000/1000 VUs, 2547 complete and 0 interrupted iterations
default   [   7% ] 1000 VUs  0m03.9s/1m0s

running (0m04.3s), 1000/1000 VUs, 3312 complete and 0 interrupted iterations
default   [   8% ] 1000 VUs  0m04.9s/1m0s

running (0m05.3s), 1000/1000 VUs, 4089 complete and 0 interrupted iterations
default   [  10% ] 1000 VUs  0m05.9s/1m0s

running (0m06.3s), 1000/1000 VUs, 4828 complete and 0 interrupted iterations
default   [  12% ] 1000 VUs  0m06.9s/1m0s

running (0m07.3s), 1000/1000 VUs, 5530 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  0m07.9s/1m0s

running (0m08.3s), 1000/1000 VUs, 6329 complete and 0 interrupted iterations
default   [  15% ] 1000 VUs  0m08.9s/1m0s

running (0m09.3s), 1000/1000 VUs, 7136 complete and 0 interrupted iterations
default   [  17% ] 1000 VUs  0m09.9s/1m0s

running (0m10.3s), 1000/1000 VUs, 7915 complete and 0 interrupted iterations
default   [  18% ] 1000 VUs  0m10.9s/1m0s

running (0m11.3s), 1000/1000 VUs, 8686 complete and 0 interrupted iterations
default   [  20% ] 1000 VUs  0m11.9s/1m0s

running (0m12.3s), 1000/1000 VUs, 9406 complete and 0 interrupted iterations
default   [  22% ] 1000 VUs  0m12.9s/1m0s

running (0m13.3s), 1000/1000 VUs, 10166 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  0m13.9s/1m0s

running (0m14.3s), 1000/1000 VUs, 10879 complete and 0 interrupted iterations
default   [  25% ] 1000 VUs  0m14.9s/1m0s

running (0m15.3s), 1000/1000 VUs, 11619 complete and 0 interrupted iterations
default   [  27% ] 1000 VUs  0m15.9s/1m0s

running (0m16.3s), 1000/1000 VUs, 12433 complete and 0 interrupted iterations
default   [  28% ] 1000 VUs  0m16.9s/1m0s

running (0m17.3s), 1000/1000 VUs, 13190 complete and 0 interrupted iterations
default   [  30% ] 1000 VUs  0m17.9s/1m0s

running (0m18.3s), 1000/1000 VUs, 13947 complete and 0 interrupted iterations
default   [  32% ] 1000 VUs  0m18.9s/1m0s

running (0m19.3s), 1000/1000 VUs, 14819 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  0m19.9s/1m0s

running (0m20.3s), 1000/1000 VUs, 15458 complete and 0 interrupted iterations
default   [  35% ] 1000 VUs  0m20.9s/1m0s

running (0m21.3s), 1000/1000 VUs, 16281 complete and 0 interrupted iterations
default   [  37% ] 1000 VUs  0m21.9s/1m0s

running (0m22.3s), 1000/1000 VUs, 17001 complete and 0 interrupted iterations
default   [  38% ] 1000 VUs  0m22.9s/1m0s

running (0m23.3s), 1000/1000 VUs, 17662 complete and 0 interrupted iterations
default   [  40% ] 1000 VUs  0m23.9s/1m0s

running (0m24.3s), 1000/1000 VUs, 18487 complete and 0 interrupted iterations
default   [  42% ] 1000 VUs  0m24.9s/1m0s

running (0m25.3s), 1000/1000 VUs, 19285 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  0m25.9s/1m0s

running (0m26.3s), 1000/1000 VUs, 20000 complete and 0 interrupted iterations
default   [  45% ] 1000 VUs  0m26.9s/1m0s

running (0m27.3s), 1000/1000 VUs, 20890 complete and 0 interrupted iterations
default   [  47% ] 1000 VUs  0m27.9s/1m0s

running (0m28.3s), 1000/1000 VUs, 21634 complete and 0 interrupted iterations
default   [  48% ] 1000 VUs  0m28.9s/1m0s

running (0m29.3s), 1000/1000 VUs, 22338 complete and 0 interrupted iterations
default   [  50% ] 1000 VUs  0m29.9s/1m0s

running (0m30.3s), 1000/1000 VUs, 23031 complete and 0 interrupted iterations
default   [  52% ] 1000 VUs  0m30.9s/1m0s

running (0m30.7s), 1000/1000 VUs, 23746 complete and 0 interrupted iterations
default   [  53% ] 1000 VUs  0m31.9s/1m0s

running (0m31.7s), 1000/1000 VUs, 24470 complete and 0 interrupted iterations
default   [  55% ] 1000 VUs  0m32.9s/1m0s

running (0m32.7s), 1000/1000 VUs, 25247 complete and 0 interrupted iterations
default   [  57% ] 1000 VUs  0m33.9s/1m0s

running (0m33.7s), 1000/1000 VUs, 26133 complete and 0 interrupted iterations
default   [  58% ] 1000 VUs  0m34.9s/1m0s

running (0m34.7s), 1000/1000 VUs, 26938 complete and 0 interrupted iterations
default   [  60% ] 1000 VUs  0m35.9s/1m0s

running (0m35.7s), 1000/1000 VUs, 27690 complete and 0 interrupted iterations
default   [  62% ] 1000 VUs  0m36.9s/1m0s

running (0m36.7s), 1000/1000 VUs, 28415 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  0m37.9s/1m0s

running (0m37.7s), 1000/1000 VUs, 29166 complete and 0 interrupted iterations
default   [  65% ] 1000 VUs  0m38.9s/1m0s

running (0m38.7s), 1000/1000 VUs, 29903 complete and 0 interrupted iterations
default   [  67% ] 1000 VUs  0m39.9s/1m0s

running (0m39.7s), 1000/1000 VUs, 30663 complete and 0 interrupted iterations
default   [  68% ] 1000 VUs  0m40.9s/1m0s

running (0m40.7s), 1000/1000 VUs, 31436 complete and 0 interrupted iterations
default   [  70% ] 1000 VUs  0m41.9s/1m0s

running (0m41.7s), 1000/1000 VUs, 32214 complete and 0 interrupted iterations
default   [  72% ] 1000 VUs  0m42.9s/1m0s

running (0m42.7s), 1000/1000 VUs, 32979 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  0m43.9s/1m0s

running (0m43.7s), 1000/1000 VUs, 33747 complete and 0 interrupted iterations
default   [  75% ] 1000 VUs  0m44.9s/1m0s

running (0m44.7s), 1000/1000 VUs, 34528 complete and 0 interrupted iterations
default   [  77% ] 1000 VUs  0m45.9s/1m0s

running (0m45.7s), 1000/1000 VUs, 35223 complete and 0 interrupted iterations
default   [  78% ] 1000 VUs  0m46.9s/1m0s

running (0m46.7s), 1000/1000 VUs, 35909 complete and 0 interrupted iterations
default   [  80% ] 1000 VUs  0m47.9s/1m0s

running (0m47.7s), 1000/1000 VUs, 36596 complete and 0 interrupted iterations
default   [  82% ] 1000 VUs  0m48.9s/1m0s

running (0m48.7s), 1000/1000 VUs, 37405 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  0m49.9s/1m0s

running (0m49.7s), 1000/1000 VUs, 38203 complete and 0 interrupted iterations
default   [  85% ] 1000 VUs  0m50.9s/1m0s

running (0m50.7s), 1000/1000 VUs, 39019 complete and 0 interrupted iterations
default   [  87% ] 1000 VUs  0m51.9s/1m0s

running (0m51.7s), 1000/1000 VUs, 39832 complete and 0 interrupted iterations
default   [  88% ] 1000 VUs  0m52.9s/1m0s

running (0m52.7s), 1000/1000 VUs, 40648 complete and 0 interrupted iterations
default   [  90% ] 1000 VUs  0m53.9s/1m0s

running (0m53.7s), 1000/1000 VUs, 41298 complete and 0 interrupted iterations
default   [  92% ] 1000 VUs  0m54.9s/1m0s

running (0m54.7s), 1000/1000 VUs, 41944 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  0m55.9s/1m0s

running (0m55.7s), 1000/1000 VUs, 42797 complete and 0 interrupted iterations
default   [  95% ] 1000 VUs  0m56.9s/1m0s

running (0m56.7s), 1000/1000 VUs, 43645 complete and 0 interrupted iterations
default   [  97% ] 1000 VUs  0m57.9s/1m0s

running (0m57.7s), 1000/1000 VUs, 44437 complete and 0 interrupted iterations
default   [  98% ] 1000 VUs  0m58.9s/1m0s

running (0m58.7s), 1000/1000 VUs, 45134 complete and 0 interrupted iterations
default   [ 100% ] 1000 VUs  0m59.9s/1m0s


  █ TOTAL RESULTS 

    CUSTOM
    benchmark_slow_failure_rate....: 34.18% 15809 out of 46240
    benchmark_total_failure_rate...: 34.18% 15809 out of 46240

    HTTP
    http_req_duration..............: avg=1.27s min=16.72µs  med=924ms    max=58.7s  p(90)=1.11s p(95)=1.16s
      { expected_response:true }...: avg=1.12s min=16.72µs  med=923.58ms max=58.56s p(90)=1.1s  p(95)=1.16s
    http_req_failed................: 0.26%  123 out of 46240
    http_reqs......................: 46240  778.185713/s

    EXECUTION
    iteration_duration.............: avg=1.3s  min=443.47ms med=928.37ms max=1m0s   p(90)=1.11s p(95)=1.16s
    iterations.....................: 46240  778.185713/s
    vus............................: 1000   min=1000           max=1000
    vus_max........................: 1000   min=1000           max=1000

    NETWORK
    data_received..................: 12 MB  193 kB/s
    data_sent......................: 7.2 MB 121 kB/s



running (0m59.4s), 0000/1000 VUs, 46240 complete and 0 interrupted iterations
default ✓ [ 100% ] 1000 VUs  1m0s